# Tratamento de datas

In [1]:
import numpy as np
import pandas as pd

import seaborn as sns
import matplotlib.pyplot as plt

import sidetable
import pandas_profiling
import missingno as msno
from ipywidgets import interact, widgets

from sklearn import datasets
from sklearn.preprocessing import scale, minmax_scale, power_transform

In [2]:
df = pd.read_csv('https://query.data.world/s/2gfb7bmzhna6kcbpc7admwa6cexprz', usecols=['Date','Fatalities']).dropna()
print(df.shape)
df.head()

(5256, 2)

         Date  Fatalities
0  09/17/1908         1.0
1  07/12/1912         5.0
2  08/06/1913         1.0
3  09/09/1913        14.0
4  10/17/1913        30.0

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5256 entries, 0 to 5267
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        5256 non-null   object
 1   Fatalities  5256 non-null   float64
dtypes: float64(1), object(1)
memory usage: 123.2+ KB

In [4]:
df.dtypes

Date           object
Fatalities    float64
dtype: object

### Formatando data automaticamente ao ler tabela
### Automatically formatting date when reading table

In [14]:
df = pd.read_csv('https://query.data.world/s/2gfb7bmzhna6kcbpc7admwa6cexprz', usecols=['Date','Fatalities'], parse_dates=['Date']).dropna()
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5256 entries, 0 to 5267
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        5256 non-null   datetime64[ns]
 1   Fatalities  5256 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 123.2 KB

In [8]:
df.tail()

           Date  Fatalities
5263 2009-05-20        98.0
5264 2009-05-26         4.0
5265 2009-06-01       228.0
5266 2009-06-07         1.0
5267 2009-06-08        13.0

Outra opção é converter o data type 
Another option is to convert the data type
---

das colunas que representam data:

In [10]:
# Podemos permitir que o pandas infira automaticamente o formato da data se possível (padrão do Pandas)
pd.to_datetime(df.Date)

0      1908-09-17
1      1912-07-12
2      1913-08-06
3      1913-09-09
4      1913-10-17
          ...
5263   2009-05-20
5264   2009-05-26
5265   2009-06-01
5266   2009-06-07
5267   2009-06-08
Name: Date, Length: 5256, dtype: datetime64[ns]

In [11]:
df['Date'].astype('datetime64[ns]')

0      1908-09-17
1      1912-07-12
2      1913-08-06
3      1913-09-09
4      1913-10-17
          ...
5263   2009-05-20
5264   2009-05-26
5265   2009-06-01
5266   2009-06-07
5267   2009-06-08
Name: Date, Length: 5256, dtype: datetime64[ns]

In [16]:
df.tail()

           Date  Fatalities
5263 2009-05-20        98.0
5264 2009-05-26         4.0
5265 2009-06-01       228.0
5266 2009-06-07         1.0
5267 2009-06-08        13.0

### Especificando o formato (para dataset grande costuma ser inclusive mais rápido)
### Specifying the format (for large datasets this is usually even faster)

In [17]:
df['Date'] = pd.to_datetime(df['Date'], format='%m/%d/%Y')
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5256 entries, 0 to 5267
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        5256 non-null   datetime64[ns]
 1   Fatalities  5256 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 123.2 KB

In [19]:
df.tail()
# vide documentação](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DatetimeIndex.html))

           Date  Fatalities
5263 2009-05-20        98.0
5264 2009-05-26         4.0
5265 2009-06-01       228.0
5266 2009-06-07         1.0
5267 2009-06-08        13.0

In [21]:
df['Date'].dt.freq

0      1908-09-17
1      1912-07-12
2      1913-08-06
3      1913-09-09
4      1913-10-17
          ...
5263   2009-05-20
5264   2009-05-26
5265   2009-06-01
5266   2009-06-07
5267   2009-06-08
Name: Date, Length: 5256, dtype: datetime64[ns]

In [24]:
# Mostrando todos atributos e funções acessíveis pelo método dt
# Assuming df is your DataFrame and 'Date' is the column with datetime values
datetime_attributes = dir(df['Date'].dt)

# Displaying the attributes and methods
print(datetime_attributes)

['__annotations__', '__class__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__frozen', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__le__', '__lt__', '__module__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__weakref__', '_accessors', '_add_delegate_accessors', '_constructor', '_delegate_method', '_delegate_property_get', '_delegate_property_set', '_dir_additions', '_dir_deletions', '_freeze', '_get_values', '_hidden_attrs', '_parent', '_reset_cache', 'ceil', 'date', 'day', 'day_name', 'day_of_week', 'day_of_year', 'dayofweek', 'dayofyear', 'days_in_month', 'daysinmonth', 'floor', 'freq', 'hour', 'is_leap_year', 'is_month_end', 'is_month_start', 'is_quarter_end', 'is_quarter_start', 'is_year_end', 'is_year_start', 'isocalendar', 'microsecond', 'minute', 'month', 'month_name', 'nanosecond', 'normalize', 'quarter', 'round', 'second', 'strftime', 'time', 'timetz', 'to_period', 'to_pydatetime', 'tz', 'tz_convert', 'tz_localize', 'week', 'weekday', 'weekofyear', 'year']

In [26]:
df['Date'].dt.day_name()

0        Thursday
1          Friday
2       Wednesday
3         Tuesday
4          Friday
          ...
5263    Wednesday
5264      Tuesday
5265       Monday
5266       Sunday
5267       Monday
Name: Date, Length: 5256, dtype: object

In [27]:
df['Date'].dt.month_name()

0       September
1            July
2          August
3       September
4         October
          ...
5263          May
5264          May
5265         June
5266         June
5267         June
Name: Date, Length: 5256, dtype: object

In [29]:
df['Date'].dt.dayofweek

0       3
1       4
2       2
3       1
4       4
       ..
5263    2
5264    1
5265    0
5266    6
5267    0
Name: Date, Length: 5256, dtype: int64

In [30]:
df['Date'].dt.second

0       0
1       0
2       0
3       0
4       0
       ..
5263    0
5264    0
5265    0
5266    0
5267    0
Name: Date, Length: 5256, dtype: int64

In [31]:
df.head()

        Date  Fatalities
0 1908-09-17         1.0
1 1912-07-12         5.0
2 1913-08-06         1.0
3 1913-09-09        14.0
4 1913-10-17        30.0

In [35]:
df_index = df.set_index('Date').sort_index()
df_index

            Fatalities
Date
1908-09-17         1.0
1912-07-12         5.0
1913-08-06         1.0
1913-09-09        14.0
1913-10-17        30.0
...                ...
2009-05-20        98.0
2009-05-26         4.0
2009-06-01       228.0
2009-06-07         1.0
2009-06-08        13.0

[5256 rows x 1 columns]

In [36]:
df_index.loc['2000':'2003']

            Fatalities
Date
2000-01-05         1.0
2000-01-10        10.0
2000-01-13        22.0
2000-01-15         5.0
2000-01-25         4.0
...                ...
2003-11-29        20.0
2003-12-16         2.0
2003-12-18         3.0
2003-12-23         2.0
2003-12-25       140.0

[281 rows x 1 columns]

In [37]:
df_index.loc['2000-05':'2003-08-10']

            Fatalities
Date
2000-05-02         2.0
2000-05-03         1.0
2000-05-10         6.0
2000-05-17         3.0
2000-05-21        19.0
...                ...
2003-07-13         4.0
2003-07-19        14.0
2003-07-23         5.0
2003-08-04         2.0
2003-08-08         1.0

[235 rows x 1 columns]

In [39]:
# Agrupando por ano e somando as fatalidades
df_index.resample('M').sum()

            Fatalities
Date
1908-09-30         1.0
1908-10-31         0.0
1908-11-30         0.0
1908-12-31         0.0
1909-01-31         0.0
...                ...
2009-02-28       102.0
2009-03-31        44.0
2009-04-30        65.0
2009-05-31       120.0
2009-06-30       242.0

[1210 rows x 1 columns]

Offset Alieses - https://pandas.pydata.org/docs/reference/api/pandas.Series.dt.html
https://pandas.pydata.org/docs/reference/api/pandas.Series.dt.date.html#pandas-series-dt-date

In [40]:
# Agrupando por ano e somando as fatalidades  - Grouping by year and adding fatalities
df_index.resample('YS').sum()

            Fatalities
Date
1908-01-01         1.0
1909-01-01         0.0
1910-01-01         0.0
1911-01-01         0.0
1912-01-01         5.0
...                ...
2005-01-01      1306.0
2006-01-01      1136.0
2007-01-01       931.0
2008-01-01       820.0
2009-01-01       581.0

[102 rows x 1 columns]